<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class LocationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $regions_ru = [

            'Винницкая',
            'Волынская',
            'Днепропетровская',
            'Донецкая',
            'Житомирская',
            'Закарпатская',
            'Запорожская',
            'Ивано-Франковская',
            'Киевская',
            'Кировоградская',
            'Луганская',
            'Львовская',
            'Николаевская',
            'Одесская',
            'Полтавская',
            'Ровенская',
            'Сумская',
            'Тернопольская',
            'Харьковская',
            'Херсонская',
            'Хмельницкая',
            'Черкасская',
            'Черниговская',
            'Черновицкая',

        ];

        $regions_uk = [

            'Вінницька',
            'Волинська',
            'Дніпропетровська',
            'Донецька',
            'Житомирська',
            'Закарпатська',
            'Запорізька',
            'Івано-Франківська',
            'Київська',
            'Кіровоградська',
            'Луганська',
            'Львівська',
            'Миколаївська',
            'Одеська',
            'Полтавська',
            'Рівненська',
            'Сумська',
            'Тернопільська',
            'Харківська',
            'Херсонська',
            'Хмельницька',
            'Черкаська',
            'Чернівецька',
            'Чернігівська',
        ];

        $cities_ru = [

            'Винница',
            'Луцк',
            'Днепр',
            'Донецк',
            'Житомир',
            'Ужгород',
            'Запорожье',
            'Ивано-Франковск',
            'Киев',
            'Кировоград',
            'Луганск',
            'Львов',
            'Николаев',
            'Одесска',
            'Полтава',
            'Ровно',
            'Сумы',
            'Тернополь',
            'Харьков',
            'Херсон',
            'Хмельницк',
            'Черкассы',
            'Чернигов',
            'Черновцы',

        ];

        $cities_uk = [

            'Вінниця',
            'Луцк',
            'Дніпро',
            'Донецк',
            'Житомир',
            'Ужгород',
            'Запоріжжя',
            'Івано-Франківськ',
            'Київ',
            'Кіровоград',
            'Луганськ',
            'Львів',
            'Миколаїв',
            'Одеса',
            'Полтава',
            'Рівне',
            'Суми',
            'Тернопіль',
            'Харків',
            'Херсон',
            'Хмельницьк',
            'Черкаси',
            'Чернівці',
            'Чернігів',
        ];

        $data_regions = [];
        foreach ($regions_ru as $i => $region_ru) {
            $data_regions[] = [
                'title_ru'  => $region_ru,
                'title_uk'  => array_get($regions_uk, $i),
                'published' => true
            ];
        }
        $data_cities = [];
        foreach ($cities_ru as $i => $city_ru) {
            $data_cities[] = [
                'title_ru'  => $city_ru,
                'title_uk'  => array_get($cities_uk, $i),
                'region_id'  => $i+1,
                'published' => true
            ];
        }

        DB::table('regions')->insert($data_regions);

        DB::table('cities')->insert($data_cities);
    }

}
