<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class StaticPageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        /*статические страницы*/

        DB::table('pages')->insert([
            'title_ru' => 'О компании',
            'title_uk' => 'Про компанію',
            'description_ru' => 'Компания «Капитал» выдает потребительские кредиты под залог техники. Прежде чем выдать наличные клиенту, специалист оценивает залоговое имущество. Что включает в себя экспертиза техники, сколько времени она занимает, как проводится - ответы на все эти вопросы вы найдете ниже.
Виды техники принимает залоговое учреждение «Капитал»?
  1. Смартфоны и телефоны
  2. Компьютерную технику и комплектующие к ней: ПК, ноутбуки, планшеты, принтеры, сканеры
  3. Бытовую технику: большую (кухонные комбайны и пылесосы, стиральные машины и СВЧ-печи, холодильники и мультиварки) и мелкую (блендеры, тостеры, электрочайники, фены, утюги)
  4. Строительную технику: перфораторы и дрели, сварочные аппараты, лебедки, электропилы, дрели, генераторы
  5. Аудио-, фото- и видеотехнику: фотоаппараты, видеокамеры, музыкальное и сценическое оборудование и т.д.',
            'description_uk' => 'Компанія «Капітал» видає споживчі кредити під заставу техніки. Перш ніж видати готівку клієнту, фахівець оцінює заставне майно. Що включає в себе експертиза техніки, скільки часу вона забирає, як проводиться - відповіді на всі ці питання ви знайдете нижче.
Які види техніки приймає заставне установа «Капітал»?
  1.   Смартфони і телефони
  2.   Комп\'ютерну техніку та комплектуючі до неї: ПК, ноутбуки, планшети, принтери, сканери
  3.   Побутову техніку: велику (кухонні комбайни та пилососи, пральні машини і СВЧ-печі, холодильники і мультиварки) і дрібну (блендери, тостери, електрочайники, фени, праски)
  4.   Будівельну техніку: перфоратори і дрелі, зварювальні апарати, лебідки, електропили, дрилі, генератори
  5.   Аудіо-, фото- і відеотехніку: фотоапарати, відеокамери, музичне і сценічне обладнання і т.д.',
            'alias' => 'about'
        ]);
        DB::table('pages')->insert([
            'title_ru' => 'Сотрудничество',
            'title_uk' => 'Співробітництво',
            'description_ru' => 'Если у вас есть предложения для нас, то обратитесь в нужный отдел:
Отдел маркетинга (для предложений по размещению рекламы)
vershnnyak.v@lombard.credit
Для успешной работы отдела маркетинга, с реализацией своих задач, ему нужно задать место и соответствующие полномочия в общей организационной структуре компании. Взаимодействие отдела маркетинга с остальными департаментами может быть организовано по нескольким принципам. Департаменты рекламы, маркетинга и продаж могут находиться под непосредственным руководством соответствующих директоров (по рекламе, маркетингу и продажам).  Другой вариант предполагает, что отдел рекламы и маркетинга находится под управлением директора по маркетингу, а департаментом продаж руководит директор по продажам.

Отдел развития (для предложений по аренде помещений)
burkut.a@lombard.credit
Чем занимается отдел стратегического планирования?» - у каждого «бизнес-читателя» спонтанно проявится свой первый ассоциативный ответ на этот вопрос, также как в случае ответа на вопрос о самом известном русском поэте...  В статье предлагается соотнести свой первый спонтанный ответ с вариантами …  Возможно мнение, что подобные отделы занимаются вопросами не очень понятными, что, отчасти, справедливо…Например, Джек Уэлч просто разогнал отделы стратегического планирования в GE, когда был CEO.. Возможно иное мнение, что подобные подразделения нужны настолько, насколько помогают руководству выстраивать необходимую систему управления и т.п. ... Как определяется функциональность отдела стратегического планирования? -  Также как в случае любого другого подразделения, - от поставленных целей и задач, от организационного контекста (типа холдинга), масштабов бизнеса, «зрелости» управленческой практики, корпоративной культуры и т.п.',
            'description_uk' => 'Якщо у вас є пропозиції для нас, то зверніться до потрібного відділу:
Відділ маркетингу (для пропозіцій з размещения реклами)
vershnnyak.v@lombard.credit
Для успішної роботи відділу маркетингу, з реалізацією своїх завдань, йому потрібно задати місце і відповідні повноваження в загальній організаційній структурі компанії. Взаємодія відділу маркетингу з іншими департаментами може бути організовано за декількома принципами. Департаменти реклами, маркетингу і продажів можуть перебувати під безпосереднім керівництвом відповідних директорів (по рекламі, маркетингу та продажу). Інший варіант передбачає, що відділ реклами і маркетингу знаходиться під управлінням директора по маркетингу, а департаментом продажів керує директор з продажу.

Відділ розвитку (для пропозіцій з оренди приміщень)
burkut.a@lombard.credit
Чим займається відділ стратегічного планування? »- у кожного« бізнес-читача »спонтанно проявиться свій перший асоціативний відповідь на це питання, так само як у випадку відповіді на питання про найвідомішого російською поета ... У статті пропонується співвіднести свій перший спонтанний відповідь з варіантами ... Можливо думка, що подібні відділи займаються питаннями не дуже зрозумілими, що, почасти, справедливо ... Наприклад, Джек Уелч просто розігнав відділи стратегічного планування в GE, коли був CEO .. Можливо інша думка, що подібні підрозділи ужни настільки, наскільки допомагають керівництву вибудовувати необхідну систему управління і т.п. ... Як визначається функціональність відділу стратегічного планування? - Так само, як у випадку будь-якого іншого підрозділу, - від поставлених цілей і завдань, від організаційного контексту (типу холдингу), масштабів бізнесу, «зрілості» управлінської практики, корпоративної культури і т.п.',
            'alias' => 'collaboration'
        ]);
        DB::table('pages')->insert([
            'title_ru' => 'Контакты',
            'title_uk' => 'Контакти',
            'description_ru' => 'Мы всегда открыты для сотрудничества и для общения с клиентами. Звоните, операторы горячей линии с удовольствием ответят на все интересующие вас вопросы.',
            'description_uk' => 'Про и завжди відкриті для спілкування з клієнтами і для співпраці. Телефонуйте і оператори гарячої лінії із задоволенням дадуть відповідь на всі ваші питання.',
            'alias' => 'contacts'
        ]);
        DB::table('pages')->insert([
            'title_ru' => 'Наши достижения',
            'title_uk' => 'Наші досягнення',
            'description_ru' => 'Мы благодарны нашим клиентам за выбор ломбарда «Капитал»
Благодаря вашей доверии и высокой оценке нашей работы на протяжении многих лет мы остаемся лидерами в сфере залогового микрокредитования. Это подтверждено престижными наградами, получившая наша сеть ломбардов.',
            'description_uk' => 'Ми вдячні нашим клієнтам за вибір ломбарду «Капитал»
Завдяки вашій довірі та високій оцінці нашої роботи впродовж багатьох років ми залишаємося лідерами у сфері заставного мікрокредитування. Це підтверджено престижними нагородами, що отримала наша мережа ломбардів.',
            'alias' => 'rewards'
        ]);
        DB::table('pages')->insert([
            'title_ru' => 'Кредит под залог - очень просто',
            'title_uk' => 'Кредит під заставу - дуже просто',
            'description_ru' => 'Сделайте три шага и получите кредит наличными всег за 7 минут',
            'description_uk' => 'Зробіть три кроки і отримаєте кредит готівкою всег за 7 хвилин',
            'alias' => 'get-credit'
        ]);
    }
}