<?php

return [

    /*
    |--------------------------------------------------------------------------
    | словарь всех страниц страниц
    |--------------------------------------------------------------------------
    |
    |
    |
    */

    /*    кнопки    */
    'from' => 'с',
    'to' => 'по',
    'details' => 'Подробнее',
    'all_actions' => 'Все акции',
    'all_news' => 'Все новости',
    'all_categories' => 'Все категории',
    'all_cities' => 'Все города',
    'subscribe' => 'Подписаться',
    'calculate' => 'Рассчитать',
    'credit' => 'кредит',
    'back_home' => 'Вернуться на главную',
    'send_resume' => 'Отправить резюме',
    'send' => 'Отправить',

    /*    404    */
    'not_found' => 'Упс, страница не найдена',
    'back_to_main' => 'Вернуться на главную',

    /*    заголовки  главная страница  */

    'credit_calculator' => 'Кредитный калькулятор',
    'how_to_get_credit' => 'Как получить кредит',
    'main' => 'Главная',
    'offices' => 'Отделения',
    'credits' => 'Кредиты',
    'for_clients' => 'Клиентам',
    'about' => 'О компании',
    'online_chat' => 'Онлайн чат',
    'search' => 'Поиск',
    'company_rewards' => 'Награды компании',
    'collaboration' => 'Сотрудничество',
    'calculate_credit' => 'Рассчитать кредит',
    'calculate_my_credit' => 'Рассчитать мой кредит',
    'calculate_bail' => 'Определите примерную стоимость залога и оставьте заявку на получение кредита',
    'vacancies' => 'Вакансии',
    'private_office' => 'Личный кабинет',
    'contacts' => 'Контакты',
    'call_free' => 'Звоните бесплатно',
    'you_get' => 'Вы получаете',
    'on_bail' => 'Под залог',
    'special_abilities' => 'Специальные возможности',
    'actions' => 'Акции',
    'our_actions' => 'Наши акции',
    'get_news' => 'Узнать все акции и новости первым',
    'last_news' => 'Последние новости',
    'achievements' => 'Достижения',
    'years_on_market' => 'лет на рынке',
    'offices_amount' => 'отделений по украине',
    'cities' => 'городов',
    'happy_clients' => 'довольных клиетов',
    'given_credits' => 'выданых кредитов',
    'feedbacks' => 'Отзывы клиентов',

    /*    заголовки  раздел новости  */

    'news' => 'Новости',
    'show_news' => 'Показывать новости:',
    'calculate_message' => 'Определите приблизительную стоимость залога и оставьте заявку на получение кредита',
    'share' => 'Поделиться в: ',
    'no_news' => 'Нет новостей',
    'try_more' => 'Попробуйте применить другой фильтр',

    /*    заголовки  раздел отделения  */

//    'offices' => 'Отделения',
    'choose_city' => 'Выберите город',
    'choose_office' => 'Выберите отделение',
    'all_offices' => 'Все отделения',
    'city' => 'Город:',

    /*    заголовки  раздел акции  */

    'show_actions' => 'Показывать акции:',
    'archive_actions' => 'Архив акций:',
    'offers_unavailable' => 'На данный момент предложения временно не доступны',
    'follow_our_news' => 'Следите за нашими новостями, чтобы не пропустить выгодные акции',

    /*    раздел поиска  */

    'search_results' => 'Результаты поиска:',

    'start_type' => 'Начните вводить текст...',

    /*    заголовки  раздел тарифные планы  */

    'tariff_plans' => 'Тарифные планы',
    'max_term' => 'максимальний срок кредитования',
    'discover_tariffs' => 'Узнать тарифные планы',

    /*   страница 404  */

    '404_message' => 'Упс, страница не найдена',

    /*    заголовки  раздел вакансии  */

    'region' => 'Регион',
    'categories' => 'Категории',

    /*   заголовки  раздел часто задаваемые вопросы  */

    'faqs' => 'Часто задаваемые вопросы',
    'all' => 'Все',
    'have_questions' => 'Остались вопросы?',
    'callbacks_free' => 'Звонки бесплатные  ',
    'callbacks_request_message' => '  или заполните форму и мы Вам перезвоним',
    'your_name' => 'Ваше имя',
    'your_phone' => 'Ваш телефон',

    /*   словарь для раздела финансовой отчетности  */

    'financial_reports' => 'Реквизиты и финансовая отчетность',
    'certificate' => 'Свидетельство о регистрации финансового учереждения: ',

    /* Акции */

    'action_conditions' => 'Официальные условия акции:',

    //Отделения
    'office' => 'Отделение',

    /*  заказ обратного звонка   */

    'enter_your_phone' => 'Введите ваш номер телефона, чтобы мы смогли вам помочь.',
    'callback' => 'Обратный звонок',
    'thanks_for_feedback' => 'Спасибо за отклик!',
    'we_will_call' => 'Мы вам перезвоним в ближайшее время.'
];
