<?php

return [

    /*
    |--------------------------------------------------------------------------
    | словарь всех страниц
    |--------------------------------------------------------------------------
    |
    |
    |
    */


    /*    кнопки    */
    'from' => 'з',
    'to' => 'по',
    'details' => 'Детальніше',
    'all_actions' => 'Всі акції',
    'all_news' => 'Всі новини',
    'all_categories' => 'Усі категорії',
    'all_cities' => 'Усі міста',
    'subscribe' => 'Підписатися',
    'calculate' => 'Розрахувати',
    'credit' => 'кредит',
    'back_home' => 'Повернутися на головну',
    'send_resume' => 'Відправити резюме',
    'send' => 'Відправити',

    /*    404    */
    'not_found' => 'Упс, сторінка не знайдена',
    'back_to_main' => 'Повернутися на головну',

    /*    заголовки  главная страница  */

    'credit_calculator' => 'Кредитний калькулятор',
    'how_to_get_credit' => 'Як отримати кредит',
    'main' => 'Головна',
    'offices' => 'Відділення',
    'credits' => 'Кредити',
    'for_clients' => 'Клієнтам',
    'private_office' => 'Особистий кабінет',
    'about' => 'Про компанію',
    'contacts' => 'Контакти',
    'search' => 'Пошук',
    'collaboration' => 'Співпраця',
    'vacancies' => 'Вакансії',
    'company_rewards' => 'Нагороди компанії',
    'online_chat' => 'Онлайн чат',
    'calculate_credit' => 'Розрахувати кредит',
    'calculate_my_credit' => 'Розрахувати мій кредит',
    'calculate_bail' => 'Визначте приблизну вартість застави і залиште заявку на отримання кредиту',
    'call_free' => 'Дзвоніть безкоштовно',
    'you_get' => 'Ви отримуєте',
    'on_bail' => 'Під заставу',
    'special_abilities' => 'Спеціальні можливості',
    'actions' => 'Акції',
    'our_actions' => 'Наши акції',
    'get_news' => 'Дізнатися про всі акції та новини першим',
    'last_news' => 'Останні новини',
    'achievements' => 'Досягнення',
    'years_on_market' => 'років на ринку',
    'offices_amount' => 'відділень по Україні',
    'cities' => 'міст',
    'happy_clients' => 'задоволених клієнтів',
    'given_credits' => 'виданих кредитів',
    'feedbacks' => 'Відгуки клієнтів',

    /*    заголовки  раздел новости  */

    'news' => 'Новини',
    'show_news' => 'Показувати новини:',
    'calculate_message' => 'Визначте приблизну вартість застави і залиште заявку на отримання кредита',
    'share' => 'Поділитися в: ',
    'no_news' => 'Нема новин',
    'try_more' => 'Спробуйте застосувати інший фільтр',

    /*    заголовки  раздел отделения  */

//    'offices' => 'Відділення',
    'choose_city' => 'Виберіть місто',
    'choose_office' => 'Виберіть відділення',
    'all_offices' => 'Всі відділення',
    'city' => 'Місто:',


    /*    заголовки  раздел акции  */

    'show_actions' => 'Показувати акції:',
    'archive_actions' => 'Архів акцій:',
    'offers_unavailable' => 'На даний момент пропозиції тимчасово не доступні',
    'follow_our_news' => 'Слідкуйте за нашими новинами, щоб не пропустити вигідні акції',

    /*    раздел поиска  */

    'search_results' => 'Результати пошуку:',

    'start_type' => 'Почніть вводити текст...',

    /*    заголовки  раздел тарифные планы  */

    'tariff_plans' => 'Тарифні плани',
    'max_term' => 'максимальний термін кредитування',
    'discover_tariffs' => 'Дізнатися тарифні плани',

    /*   страница 404  */

    '404_message' => 'Упс, сторінка не знайдена',

    /*    заголовки  раздел вакансии  */

    'region' => 'Регіон',
    'categories' => 'Категорії',

    /*   заголовки  раздел часто задаваемые вопросы  */

    'faqs' => 'Поширені запитання',
    'all' => 'Всі',
    'have_questions' => 'Залишились питання?',
    'callbacks_free' => 'Дзвінки безкоштовні ',
    'callbacks_request_message' => '  або заповніть форму і ми Вам передзвонимо',
    'your_name' => 'Ваше ім\'я',
    'your_phone' => 'Ваш телефон',

    /*   словарь для раздела финансовой отчетности  */

    'financial_reports' => 'Реквізити та фінансова звітність',
    'certificate' => 'Свідоцтво про реєстрацію фінансової установи: ',

    /* Акции */

    'action_conditions' => 'Офіційні умови акції:',

//    Отделения
    'office' => 'Відділення',

    /*  заказ обратного звонка   */

    'enter_your_phone' => 'Введіть ваш номер телефону, щоб ми змогли вам допомогти.',
    'callback' => 'Зворотний дзвінок',
    'thanks_for_feedback' => 'Дякуємо за відгук!',
    'we_will_call' => 'Ми вам передзвонимо найближчим часом.'
];
